Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>Номенклатура</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Производитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Производители</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетПоСериям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Услуги</Name>
					<Comment>(удалить, заменен на ТипНоменклатуры)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапретОтгрузки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойПоставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Блок</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяГруппыДляКонструктора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статья</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Статьи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеТелеграм</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаПодбора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыПодбораНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьИзАссортимента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SKU</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ЗначенияСвойствОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияСвойствОбъектов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеСвойства</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ДополнительныеСвойства</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Свойство</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеСвойства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/ВидыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ВидыНоменклатуры</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>СвойстваНоменклатуры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеСвойства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Номенклатура/Forms/КонструкторНаименования/Ext/Form/Module.bsl
// © Primus1C  18.01.2024  НАЧАЛО ►

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запр = Новый Запрос;
	Запр.Текст = "ВЫБРАТЬ
				|	ДополнительныеСвойства.ИмяПредопределенныхДанных КАК Имя
				|ИЗ
				|	ПланВидовХарактеристик.ДополнительныеСвойства КАК ДополнительныеСвойства";
	Выборка = Запр.Выполнить().Выбрать();    
	Пока Выборка.Следующий() Цикл
		Если Элементы.Найти(Выборка.Имя) <> Неопределено Тогда
			Элементы[Выборка.Имя].Видимость = Ложь;
		КонецЕсли;
	КонецЦикла;

	Запр = Новый Запрос;
	Запр.УстановитьПараметр("ВидНоменклатуры", ЭтаФорма.Параметры.ВидНоменклатуры);
	Запр.Текст = "ВЫБРАТЬ
	             |	ВидыНоменклатурыСвойстваНоменклатуры.Свойство КАК Свойство,
	             |	ВидыНоменклатурыСвойстваНоменклатуры.Свойство.ИмяПредопределенныхДанных КАК ИмяСвойства,
	             |	ЗначенияСвойствОбъектов.Ссылка КАК ЗначениеСвойства
	             |ИЗ
	             |	Справочник.ВидыНоменклатуры.СвойстваНоменклатуры КАК ВидыНоменклатурыСвойстваНоменклатуры
	             |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	             |		ПО ВидыНоменклатурыСвойстваНоменклатуры.Свойство = ЗначенияСвойствОбъектов.Владелец
	             |ГДЕ
	             |	ВидыНоменклатурыСвойстваНоменклатуры.Ссылка = &ВидНоменклатуры";
    Выборка = Запр.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Элементы[Выборка.ИмяСвойства].Видимость = Истина; 
		Если Элементы[Выборка.ИмяСвойства].Вид = ВидПоляФормы.ПолеВвода Тогда
			Элементы[Выборка.ИмяСвойства].СписокВыбора.Добавить(Выборка.ЗначениеСвойства);
			Элементы[Выборка.ИмяСвойства].УстановитьДействие("ПриИзменении", 	"ВыполнитьДействиеПриИзмененииДанных"); 
			Элементы[Выборка.ИмяСвойства].УстановитьДействие("НачалоВыбора", 	"ВыполнитьДействиеПриНачалеВыбораДанных"); 
			Элементы[Выборка.ИмяСвойства].УстановитьДействие("Очистка", 		"ВыполнитьДействиеПриОчисткеДанных"); 
		КонецЕсли;
	КонецЦикла;
	Элементы.Группы.УстановитьДействие("ПриИзменении", 	"ВыполнитьДействиеПриИзмененииДанных"); 
	Элементы.Группы.УстановитьДействие("НачалоВыбора", 	"ВыполнитьДействиеПриНачалеВыбораДанных"); 
	Элементы.Группы.УстановитьДействие("Очистка", 		"ВыполнитьДействиеПриОчисткеДанных"); 
	
	Элементы.ГруппаСпецификация.Видимость = Элементы.Спецификация.Видимость;
	
	лГруппа = "";
	Род = ЭтаФорма.Параметры.Номенклатура.Родитель;
	Пока ЗначениеЗаполнено(Род) Цикл
		Элементы.Группы.СписокВыбора.Вставить(0, Род.Наименование);
		Если ЗначениеЗаполнено(Род.ИмяГруппыДляКонструктора) И лГруппа = "" Тогда
			лГруппа = Род.ИмяГруппыДляКонструктора; 
		КонецЕсли;
		Род = Род.Родитель;
	КонецЦикла;
	Если лГруппа <> "" Тогда
		Элементы.Группы.СписокВыбора.Вставить(0, лГруппа);
       	Группы = лГруппа;
	КонецЕсли;
	
	// заполним существующие значения свойств
	
	Запр = Новый Запрос;
	Запр.УстановитьПараметр("Объект", ЭтаФорма.Параметры.Номенклатура);
	Запр.Текст = "ВЫБРАТЬ
	             |	ЗначенияСвойствОбъектов.Свойство.Наименование КАК Свойство,
	             |	ЗначенияСвойствОбъектов.ЗначениеСвойства КАК Значение
	             |ИЗ
	             |	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	             |ГДЕ
	             |	ЗначенияСвойствОбъектов.Объект = &Объект";
	Выборка = Запр.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЭтотОбъект[Выборка.Свойство] = Выборка.Значение;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	КартинкаФлаг = ОбщегоНазначения.ИндексКартинкиСпецификации(Строка(Спецификация));

КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура NFCПриИзменении(Элемент)

	СформироватьНаименование();

КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьДействиеПриИзмененииДанных(Элемент)
	
	СформироватьНаименование();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьДействиеПриНачалеВыбораДанных(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	//СтандартнаяОбработка = Ложь;
	//Имя = СтрЗаменить(Элемент.Имя, "с_", "");
	//ПараметрыВвода = Новый Структура("РежимВыбора, Отбор", Истина, Новый Структура("Владелец", pr_ОбщийМодуль.ДополнительныйРеквизит(Имя)));    
	//ДопПараметры = Новый Структура("ИмяРеквизита", Имя);
	//ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораЗначенияРеквизита", ЭтотОбъект, ДопПараметры, "ПриОшибкеВыбора", ЭтотОбъект);
	//ОткрытьФорму("Справочник.ЗначенияСвойствОбъектов.ФормаВыбора", ПараметрыВвода,,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьДействиеПриОчисткеДанных(Элемент)
	
	СформироватьНаименование();
	
КонецПроцедуры


#КонецОбласти


#Область ВспомогательныйПроцедуры

&НаКлиенте
Процедура СформироватьНаименование()
	
	КартинкаФлаг = ОбщегоНазначения.ИндексКартинкиСпецификации(Строка(Спецификация));
	
	Наименование = СтрШаблон("%1 %2 %3 %4 %5 %6 %7 %8 %9 %10 ", 
							СокрЛП(Группы), Поколение, РазмерЧасов, РазмерРемня, Диагональ, Год, МодульСвязи, РазмерКлавиатуры, Модель, Объем) +
					СтрШаблон("%1 %2 %3 %4", 
							ЦветРемня, Цвет, Спецификация, ?(NFC, "NFC", ""));
	КвоРазделителей = 13;
	Для Инд = 2 По КвоРазделителей Цикл
		ДлинаПробелов = КвоРазделителей + 2 - Инд;	
		Пробелы = "";
		Для д = 1 По ДлинаПробелов Цикл
			Пробелы = Пробелы + " ";
		КонецЦикла;
		Наименование = СтрЗаменить(Наименование, Пробелы, " ");
	КонецЦикла;							

КонецПроцедуры	

#КонецОбласти

&НаКлиенте
Процедура КомандаОк(Команда)

	Закрыть(Новый Структура("Наименование,Поколение,РазмерЧасов,РазмерРемня,Диагональ,Год,МодульСвязи,РазмерКлавиатуры,Модель,Объем,ЦветРемня,Цвет,Спецификация,NFC", 
							Наименование, Поколение, РазмерЧасов, РазмерРемня, Диагональ, Год, МодульСвязи, РазмерКлавиатуры, Модель, Объем, ЦветРемня, Цвет, Спецификация, NFC));  
КонецПроцедуры

// © Primus1C  ОКОНЧАНИЕ ◄
